* Zig-cc
Use Zig to cross compile Go/Rust projects.
#+begin_src bash :results verbatim :exports both
uname -a
zig version
cargo version
#+end_src

#+RESULTS:
: Darwin mario 23.2.0 Darwin Kernel Version 23.2.0: Wed Nov 15 21:55:06 PST 2023; root:xnu-10002.61.3~2/RELEASE_ARM64_T6020 arm64
: 0.12.0-dev.2307+1b8f7e46f
: cargo 1.70.0 (ec8a8a0ca 2023-04-25)

** Config
#+begin_src conf
# cat ~/.cargo/config

[target.x86_64-unknown-linux-musl]
linker = "zigcc"

[target.x86_64-unknown-linux-gnu]
linker = "zigcc"
#+end_src
